Tekla Open API Reference for Tekla Structures 2025
Face Properties
The Face type exposes the following members.
Properties
Name | Description
Normal
 The normal vector of the face.
OriginPartId
 The part id of the part that this face originated from. For example, a face create by a part cut has the id of the cutting part.
Top
See Also
Reference
Face Class
Tekla.Structures.Solid Namespace